Tekla Open API Reference for Tekla Structures 2025
Rotation3D Constructor (Vector, Vector)
Initializes a new instance of the Rotation3D class.
 Namespace: Tekla.Structures.Model.Geometry
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Rotation3D(
	Vector axisX,
	Vector axisY
)
Public Sub New (
	axisX As Vector,
	axisY As Vector
)
Parameters
axisX
Type: Tekla.Structures.Geometry3d.Vector
The X direction, must be unit.
axisY
Type: Tekla.Structures.Geometry3d.Vector
The Y direction, must be unit and perpendicular to axisX.
See Also
Reference
Rotation3D Class
Rotation3D Overload
Tekla.Structures.Model.Geometry Namespace